<center><h1>第四章 分组</h1></center>

In [1]:
import numpy as np
import pandas as pd

## 一、分组模式及其对象
### 1. 分组的一般模式
分组操作在日常生活中使用极其广泛，例如：

* 依据$\color{#FF0000}{性别}$分组，统计全国人口$\color{#00FF00}{寿命}$的$\color{#0000FF}{平均值}$
* 依据$\color{#FF0000}{季节}$分组，对每一个季节的$\color{#00FF00}{温度}$进行$\color{#0000FF}{组内标准化}$
* 依据$\color{#FF0000}{班级}$筛选出组内$\color{#00FF00}{数学分数}$的$\color{#0000FF}{平均值超过80分的班级}$

从上述的几个例子中不难看出，想要实现分组操作，必须明确三个要素：$\color{#FF0000}{分组依据}$、$\color{#00FF00}{数据来源}$、$\color{#0000FF}{操作及其返回结果}$。同时从充分性的角度来说，如果明确了这三方面，就能确定一个分组操作，从而分组代码的一般模式即：
```
df.groupby(分组依据)[数据来源].使用操作
```
例如第一个例子中的代码就应该如下：
```
df.groupby('Gender')['Longevity'].mean()
```

现在返回到学生体测的数据集上，如果想要按照性别统计身高中位数，就可以如下写出：

In [2]:
df = pd.read_csv('../data/learn_pandas.csv')

In [3]:
df

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [4]:
df.groupby('Gender')['Height'].median()

Gender
Female    159.6
Male      173.4
Name: Height, dtype: float64

In [8]:
df.groupby("Gender")["Weight"].mean()

Gender
Female    47.918519
Male      72.759259
Name: Weight, dtype: float64

In [9]:
df.groupby("Gender")["Weight"].median()

Gender
Female    48.0
Male      73.0
Name: Weight, dtype: float64

### 2. 分组依据的本质
前面提到的若干例子都是以单一维度进行分组的，比如根据性别，如果现在需要根据多个维度进行分组，该如何做？事实上，只需在`groupby`中传入相应列名构成的列表即可。例如，现希望根据学校和性别进行分组，统计身高的均值就可以如下写出：

In [39]:
df.Weight.values.dtype

dtype('float64')

In [40]:
df.Weight.values

array([46., 70., 89., 41., 74., 51., 52., 50., 48., nan, 74., 43., 48.,
       48., 57., 49., 68., 65., 71., 50., 47., 62., 55., 87., 69., 42.,
       48., 53., 63., 43., 41., 51., 48., 49., 51., 78., 79., 45., 87.,
       38., 79., 72., 44., 46., 51., 43., 47., 53., 79., 34., 70., 47.,
       56., 57., 58., 54., 42., 45., 50., 48., 65., nan, 43., 43., 57.,
       53., 81., 42., 53., 54., 55., 82., 70., 74., 74., 56., nan, 52.,
       53., 46., 40., 52., 76., 39., 49., 51., 49., 52., 53., 44., 43.,
       nan, 47., 51., 67., 75., 56., 54., 68., 83., 55., 55., nan, nan,
       47., 52., 40., 49., 38., 56., 47., 52., 47., 49., 53., 48., 66.,
       83., 47., nan, 34., 40., nan, nan, 44., 38., 40., 77., 45., 47.,
       51., 73., nan, 41., 83., 64., 44., 51., 50., 36., 43., 52., 44.,
       34., 44., 51., 55., 69., 49., 49., 70., 43., 62., 75., 44., 44.,
       47., 45., 76., 44., 72., 50., 65., 51., 48., 69., 46., 43., 47.,
       52., 57., 80., 53., 44., 54., 41., 51., 71., 76., 73., 50., 55.,
       73., 46., 80., 43., 53., 51., 53., 47., nan, 54., 70., 79., 49.,
       46., 50., 45., 71., 51.])

In [49]:
df.Weight.value_counts().index

Float64Index([51.0, 47.0, 44.0, 53.0, 43.0, 49.0, 52.0, 48.0, 50.0, 55.0, 46.0,
              54.0, 45.0, 70.0, 57.0, 40.0, 56.0, 74.0, 79.0, 41.0, 73.0, 38.0,
              42.0, 83.0, 69.0, 76.0, 71.0, 65.0, 34.0, 75.0, 80.0, 72.0, 87.0,
              62.0, 68.0, 58.0, 81.0, 82.0, 63.0, 39.0, 67.0, 66.0, 77.0, 89.0,
              64.0, 36.0, 78.0],
             dtype='float64')

In [48]:
df.Weight.value_counts().values.sum()

189

In [10]:
df.groupby(['School', 'Gender'])['Height'].mean()

School                         Gender
Fudan University               Female    158.776923
                               Male      174.212500
Peking University              Female    158.666667
                               Male      172.030000
Shanghai Jiao Tong University  Female    159.122500
                               Male      176.760000
Tsinghua University            Female    159.753333
                               Male      171.638889
Name: Height, dtype: float64

目前为止，`groupby`的分组依据都是直接可以从列中按照名字获取的，那如果希望通过一定的复杂逻辑来分组，例如根据学生体重是否超过总体均值来分组，同样还是计算身高的均值。

首先应该先写出分组条件：

In [23]:
df.Weight.mean()

55.01587301587302

In [25]:
condition = df.Weight > df.Weight.mean()

In [26]:
condition.value_counts()

False    139
True      61
Name: Weight, dtype: int64

然后将其传入`groupby`中：

In [27]:
df.groupby(condition)['Height'].mean()

Weight
False    159.034646
True     172.705357
Name: Height, dtype: float64

In [28]:
condition_2 = df.Weight < df.Weight.mean()

In [29]:
condition_2.value_counts()

True     128
False     72
Name: Weight, dtype: int64

In [18]:
df.groupby(condition_2)['Height'].mean()

Weight
False    171.658462
True     158.568644
Name: Height, dtype: float64

体重数据存在 nan，去掉 nan 以后

In [61]:
weights = df.dropna(how='any', subset=['Weight'])
weights

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [65]:
cond_3 = weights.Weight > weights.Weight.mean()
weights.groupby(cond_3)['Height'].mean()

Weight
False    158.568644
True     172.705357
Name: Height, dtype: float64

In [66]:
cond_4 = weights.Weight < weights.Weight.mean()
weights.groupby(cond_4)['Height'].mean()

Weight
False    172.705357
True     158.568644
Name: Height, dtype: float64

去掉缺失值之后数据就对上了。

#### 【练一练】
请根据上下四分位数分割，将体重分为high、normal、low三组，统计身高的均值。

In [67]:
low = df['Weight'].quantile(q=0.25)
low

46.0

In [68]:
high = df['Weight'].quantile(q=0.75)
high

65.0

In [71]:
cond_low = df['Weight'] < low
cond_high = df['Weight'] > high
cond_nor = (df['Weight'] > low) & (df['Weight'] < high)

In [73]:
df.groupby(cond_low)['Height'].mean()

Weight
False    165.950704
True     153.753659
Name: Height, dtype: float64

In [74]:
df.groupby(cond_nor)['Height'].mean()

Weight
False    164.084000
True     162.174699
Name: Height, dtype: float64

In [75]:
df.groupby(cond_high)['Height'].mean()

Weight
False    159.727660
True     174.935714
Name: Height, dtype: float64


#### 【END】
从索引可以看出，其实最后产生的结果就是按照条件列表中元素的值（此处是`True`和`False`）来分组，下面用随机传入字母序列来验证这一想法：

In [76]:
item = np.random.choice(list('abc'), df.shape[0])
df.groupby(item)['Height'].mean()

a    162.774242
b    162.997143
c    164.170213
Name: Height, dtype: float64

In [77]:
item

array(['b', 'c', 'a', 'a', 'a', 'b', 'c', 'b', 'a', 'c', 'a', 'a', 'a',
       'b', 'b', 'b', 'a', 'c', 'c', 'b', 'b', 'a', 'a', 'c', 'b', 'c',
       'b', 'c', 'b', 'b', 'a', 'b', 'b', 'b', 'b', 'b', 'b', 'b', 'a',
       'a', 'c', 'b', 'a', 'b', 'c', 'b', 'a', 'a', 'c', 'a', 'c', 'c',
       'c', 'a', 'a', 'a', 'c', 'b', 'a', 'b', 'c', 'b', 'b', 'c', 'a',
       'c', 'b', 'a', 'c', 'a', 'c', 'a', 'a', 'b', 'a', 'c', 'c', 'b',
       'b', 'a', 'b', 'c', 'c', 'c', 'a', 'b', 'b', 'b', 'a', 'a', 'c',
       'a', 'c', 'a', 'b', 'c', 'b', 'a', 'c', 'a', 'b', 'a', 'b', 'b',
       'a', 'c', 'b', 'a', 'c', 'b', 'a', 'a', 'a', 'a', 'b', 'c', 'a',
       'b', 'a', 'b', 'c', 'a', 'b', 'b', 'a', 'a', 'b', 'b', 'c', 'a',
       'c', 'b', 'c', 'b', 'b', 'c', 'b', 'b', 'a', 'c', 'b', 'a', 'b',
       'b', 'c', 'b', 'c', 'a', 'b', 'a', 'b', 'a', 'a', 'a', 'b', 'a',
       'c', 'b', 'a', 'b', 'c', 'c', 'c', 'a', 'a', 'c', 'c', 'a', 'a',
       'c', 'b', 'a', 'b', 'a', 'a', 'b', 'b', 'c', 'a', 'a', 'a', 'a',
       'b', 'a', 'b', 'a', 'c', 'b', 'b', 'b', 'a', 'a', 'b', 'b', 'c',
       'a', 'b', 'b', 'c', 'b'], dtype='<U1')

此处的索引就是原先item中的元素，如果传入多个序列进入`groupby`，那么最后分组的依据就是这两个序列对应行的唯一组合：

In [78]:
df.groupby([condition, item])['Height'].mean()

Weight
False   a    158.574468
        b    158.970000
        c    159.863333
True    a    173.163158
        b    173.065000
        c    171.770588
Name: Height, dtype: float64

由此可以看出，之前传入列名只是一种简便的记号，事实上等价于传入的是一个或多个列，最后分组的依据来自于数据来源组合的unique值，通过`drop_duplicates`就能知道具体的组类别：

In [79]:
df[['School', 'Gender']].drop_duplicates()

                           School  Gender
0   Shanghai Jiao Tong University  Female
1               Peking University    Male
2   Shanghai Jiao Tong University    Male
3                Fudan University  Female
4                Fudan University    Male
5             Tsinghua University  Female
9               Peking University  Female
16            Tsinghua University    Male

In [80]:
df.groupby([df['School'], df['Gender']])['Height'].mean()

School                         Gender
Fudan University               Female    158.776923
                               Male      174.212500
Peking University              Female    158.666667
                               Male      172.030000
Shanghai Jiao Tong University  Female    159.122500
                               Male      176.760000
Tsinghua University            Female    159.753333
                               Male      171.638889
Name: Height, dtype: float64

### 3. Groupby对象
能够注意到，最终具体做分组操作时，所调用的方法都来自于`pandas`中的`groupby`对象，这个对象上定义了许多方法，也具有一些方便的属性。

In [81]:
gb = df.groupby(['School', 'Grade'])
gb

通过`ngroups`属性，可以得到分组个数：

In [82]:
gb.ngroups

16

通过`groups`属性，可以返回从$\color{#FF0000}{组名}$映射到$\color{#FF0000}{组索引列表}$的字典：

In [83]:
res = gb.groups
res.keys() # 字典的值由于是索引，元素个数过多，此处只展示字典的键

dict_keys([('Fudan University', 'Freshman'), ('Fudan University', 'Junior'), ('Fudan University', 'Senior'), ('Fudan University', 'Sophomore'), ('Peking University', 'Freshman'), ('Peking University', 'Junior'), ('Peking University', 'Senior'), ('Peking University', 'Sophomore'), ('Shanghai Jiao Tong University', 'Freshman'), ('Shanghai Jiao Tong University', 'Junior'), ('Shanghai Jiao Tong University', 'Senior'), ('Shanghai Jiao Tong University', 'Sophomore'), ('Tsinghua University', 'Freshman'), ('Tsinghua University', 'Junior'), ('Tsinghua University', 'Senior'), ('Tsinghua University', 'Sophomore')])

In [84]:
gb.groups

{('Fudan University', 'Freshman'): [15, 28, 63, 70, 73, 105, 108, 157, 186], ('Fudan University', 'Junior'): [26, 41, 82, 84, 90, 107, 145, 152, 173, 187, 189, 195], ('Fudan University', 'Senior'): [39, 46, 49, 52, 66, 77, 112, 129, 131, 138, 144], ('Fudan University', 'Sophomore'): [3, 4, 37, 48, 68, 98, 135, 170], ('Peking University', 'Freshman'): [1, 32, 35, 36, 38, 45, 54, 57, 88, 96, 99, 140, 185], ('Peking University', 'Junior'): [9, 20, 59, 72, 75, 102, 159, 183], ('Peking University', 'Senior'): [30, 86, 116, 127, 130, 132, 147, 194], ('Peking University', 'Sophomore'): [29, 61, 83, 101, 120], ('Shanghai Jiao Tong University', 'Freshman'): [0, 6, 10, 60, 114, 117, 119, 121, 141, 148, 149, 153, 184], ('Shanghai Jiao Tong University', 'Junior'): [31, 42, 50, 56, 58, 64, 85, 93, 115, 122, 143, 155, 164, 172, 174, 188, 190], ('Shanghai Jiao Tong University', 'Senior'): [2, 12, 19, 21, 22, 23, 79, 87, 89, 103, 104, 109, 123, 134, 156, 161, 165, 166, 171, 192, 197, 198], ('Shanghai Jiao Tong University', 'Sophomore'): [13, 65, 71, 124, 167], ('Tsinghua University', 'Freshman'): [5, 8, 33, 34, 43, 44, 47, 51, 62, 67, 81, 111, 125, 133, 136, 142, 146], ('Tsinghua University', 'Junior'): [7, 11, 16, 17, 27, 69, 94, 95, 113, 118, 128, 137, 150, 154, 158, 160, 162, 163, 169, 176, 177, 191], ('Tsinghua University', 'Senior'): [14, 18, 24, 25, 78, 92, 100, 126, 168, 175, 179, 180, 193, 196], ('Tsinghua University', 'Sophomore'): [40, 53, 55, 74, 76, 80, 91, 97, 106, 110, 139, 151, 178, 181, 182, 199]}

#### 【练一练】
上一小节介绍了可以通过`drop_duplicates`得到具体的组类别，现请用`groups`属性完成类似的功能。

In [85]:
df

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [86]:
df.drop_duplicates(['School', 'Grade'])

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
5,Tsinghua University,Freshman,Xiaoli Qian,Female,158.0,51.0,N,1,2019/10/31,0:03:47
7,Tsinghua University,Junior,Gaoqiang Qian,Female,161.9,50.0,N,1,2019/9/3,0:03:45
9,Peking University,Junior,Juan Xu,Female,164.8,NaN,N,3,2019/10/5,0:04:05
13,Shanghai Jiao Tong University,Sophomore,Yanfeng Qian,Female,160.1,48.0,N,2,2019/9/19,0:05:29
14,Tsinghua University,Senior,Xiaomei Zhou,Female,165.3,57.0,N,1,2019/12/29,0:05:25
15,Fudan University,Freshman,Changqiang Yang,Female,156.0,49.0,N,3,2020/1/1,0:05:25
26,Fudan University,Junior,Yanli You,Female,NaN,48.0,N,1,2019/9/23,0:03:34
29,Peking University,Sophomore,Changmei Xu,Female,151.6,43.0,N,2,2020/1/3,0:04:28
30,Peking University,Senior,Changli Lv,Female,148.7,41.0,N,2,2019/11/13,0:04:54
31,Shanghai Jiao Tong University,Junior,Feng Zheng,Female,165.6,51.0,N,1,2019/12/20,0:05:23
39,Fudan University,Senior,Chengpeng Zheng,Female,151.7,38.0,N,2,2019/11/1,0:03:39
40,Tsinghua University,Sophomore,Li Wang,Male,175.0,79.0,N,1,2019/10/7,0:04:12

In [90]:
df.groupby(['School', 'Grade']).groups.keys()

dict_keys([('Fudan University', 'Freshman'), ('Fudan University', 'Junior'), ('Fudan University', 'Senior'), ('Fudan University', 'Sophomore'), ('Peking University', 'Freshman'), ('Peking University', 'Junior'), ('Peking University', 'Senior'), ('Peking University', 'Sophomore'), ('Shanghai Jiao Tong University', 'Freshman'), ('Shanghai Jiao Tong University', 'Junior'), ('Shanghai Jiao Tong University', 'Senior'), ('Shanghai Jiao Tong University', 'Sophomore'), ('Tsinghua University', 'Freshman'), ('Tsinghua University', 'Junior'), ('Tsinghua University', 'Senior'), ('Tsinghua University', 'Sophomore')])

#### 【END】
当`size`作为`DataFrame`的属性时，返回的是表长乘以表宽的大小，但在`groupby`对象上表示统计每个组的元素个数：

In [91]:
df.size

2000

In [93]:
df.size()

TypeError: 'numpy.int32' object is not callable

In [92]:
gb.size

In [94]:
gb.size()

School                         Grade
Fudan University               Freshman      9
                               Junior       12
                               Senior       11
                               Sophomore     8
Peking University              Freshman     13
                               Junior        8
                               Senior        8
                               Sophomore     5
Shanghai Jiao Tong University  Freshman     13
                               Junior       17
                               Senior       22
                               Sophomore     5
Tsinghua University            Freshman     17
                               Junior       22
                               Senior       14
                               Sophomore    16
dtype: int64

通过`get_group`方法可以直接获取所在组对应的行，此时必须知道组的具体名字：

In [95]:
gb.get_group(('Fudan University', 'Freshman'))

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
15,Fudan University,Freshman,Changqiang Yang,Female,156.0,49.0,N,3,2020/1/1,0:05:25
28,Fudan University,Freshman,Gaoqiang Qin,Female,170.2,63.0,N,2,2020/1/7,0:05:24
63,Fudan University,Freshman,Gaofeng Zhao,Female,152.2,43.0,N,2,2019/10/31,0:04:00
70,Fudan University,Freshman,Yanquan Wang,Female,163.5,55.0,N,1,2019/11/19,0:04:07
73,Fudan University,Freshman,Feng Wang,Male,176.3,74.0,N,1,2019/9/26,0:03:31
105,Fudan University,Freshman,Qiang Shi,Female,164.5,52.0,N,1,2019/12/11,0:04:23
108,Fudan University,Freshman,Yanqiang Xu,Female,152.4,38.0,N,1,2019/12/8,0:05:03
157,Fudan University,Freshman,Xiaoli Lv,Female,152.5,45.0,N,2,2019/9/11,0:04:17
186,Fudan University,Freshman,Yanjuan Zhao,Female,NaN,53.0,N,2,2019/10/9,0:04:21

这里列出了2个属性和2个方法，而先前的`mean`、`median`都是`groupby`对象上的方法，这些函数和许多其他函数的操作具有高度相似性，将在之后的小节进行专门介绍。
### 4. 分组的三大操作
熟悉了一些分组的基本知识后，重新回到开头举的三个例子，可能会发现一些端倪，即这三种类型分组返回的数据型态并不一样：

* 第一个例子中，每一个组返回一个标量值，可以是平均值、中位数、组容量`size`等
* 第二个例子中，做了原序列的标准化处理，也就是说每组返回的是一个`Series`类型
* 第三个例子中，既不是标量也不是序列，返回的整个组所在行的本身，即返回了`DataFrame`类型

由此，引申出分组的三大操作：聚合、变换和过滤，分别对应了三个例子的操作，下面就要分别介绍相应的`agg`、`transform`和`filter`函数及其操作。
## 二、聚合函数
### 1. 内置聚合函数
在介绍agg之前，首先要了解一些直接定义在groupby对象的聚合函数，因为它的速度基本都会经过内部的优化，使用功能时应当优先考虑。根据返回标量值的原则，包括如下函数：`max/min/mean/median/count/all/any/idxmax/idxmin/mad/nunique/skew/quantile/sum/std/var/sem/size/prod`。

这些都是函数。

In [96]:
gb = df.groupby('Gender')['Height']
gb.idxmin()

Gender
Female    143
Male      199
Name: Height, dtype: int64

In [97]:
gb.quantile(0.95)

Gender
Female    166.8
Male      185.9
Name: Height, dtype: float64

#### 【练一练】
请查阅文档，明确`all/any/mad/skew/sem/prod`函数的含义。

`all` 当所有元素都为 True 时返回 True，否则返回 False。

In [115]:
df['Weight'].values

array([46., 70., 89., 41., 74., 51., 52., 50., 48., nan, 74., 43., 48.,
       48., 57., 49., 68., 65., 71., 50., 47., 62., 55., 87., 69., 42.,
       48., 53., 63., 43., 41., 51., 48., 49., 51., 78., 79., 45., 87.,
       38., 79., 72., 44., 46., 51., 43., 47., 53., 79., 34., 70., 47.,
       56., 57., 58., 54., 42., 45., 50., 48., 65., nan, 43., 43., 57.,
       53., 81., 42., 53., 54., 55., 82., 70., 74., 74., 56., nan, 52.,
       53., 46., 40., 52., 76., 39., 49., 51., 49., 52., 53., 44., 43.,
       nan, 47., 51., 67., 75., 56., 54., 68., 83., 55., 55., nan, nan,
       47., 52., 40., 49., 38., 56., 47., 52., 47., 49., 53., 48., 66.,
       83., 47., nan, 34., 40., nan, nan, 44., 38., 40., 77., 45., 47.,
       51., 73., nan, 41., 83., 64., 44., 51., 50., 36., 43., 52., 44.,
       34., 44., 51., 55., 69., 49., 49., 70., 43., 62., 75., 44., 44.,
       47., 45., 76., 44., 72., 50., 65., 51., 48., 69., 46., 43., 47.,
       52., 57., 80., 53., 44., 54., 41., 51., 71., 76., 73., 50., 55.,
       73., 46., 80., 43., 53., 51., 53., 47., nan, 54., 70., 79., 49.,
       46., 50., 45., 71., 51.])

In [130]:
df['Height'].all()

True

In [131]:
df_tmp = df.copy()

In [134]:
df_tmp['Transfer'][0] = False

C:\Users\xukk\AppData\Local\Temp\ipykernel_1716\1012831018.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_tmp['Transfer'][0] = False

In [136]:
df_tmp.all()

School          True
Grade           True
Name            True
Gender          True
Height          True
Weight          True
Transfer       False
Test_Number     True
Test_Date       True
Time_Record     True
dtype: bool

In [138]:
df_tmp

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,False,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [139]:
df

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

`any` 只要有一个元素为 True，就返回True。

In [140]:
pd.Series([False, False]).any()

False

In [141]:
pd.Series([False, False, True]).any()

True

`idxmax`  返回对应轴上第一个最大值的索引。

In [150]:
df['Weight'].idxmax()

2

`idxmin` 返回对应轴上第一个最小索引。

In [151]:
df['Height'].idxmin()

143

`mad` mean absolute deviation


$$
MAD = \frac{\sum |x_i - \bar{x}|}{n}
$$

In [153]:
df['Height'].mad()
# 这个函数可以自动把 nan 值排除在外

6.707229239451763

In [157]:
abs((df['Height'] - df['Height'].mean())).sum() / 200

6.137114754098364

In [158]:
tmp = df['Height'].dropna()
tmp

0      158.9
1      166.5
2      188.9
4      174.0
5      158.0
       ...
195    153.9
196    160.9
197    153.9
198    175.3
199    155.7
Name: Height, Length: 183, dtype: float64

In [159]:
abs((tmp - tmp.mean())).sum() / 200

6.137114754098354

In [161]:
abs((tmp - tmp.mean())).sum() / 183

6.707229239451753

`nunique` 指定轴上不同值的数量。

In [162]:
df['Height'].nunique()

141

`skew` 偏度

 = (三阶中心距 / 标准差)^2

In [163]:
df['Height'].skew()

0.7819764922960754

`quantile` 分位数

`sum` 求和

`std` 样本标准差

`var` 无偏方差

$$
x = \frac{\sigma}{\sqrt(n)}
$$

`sem` standard error of the mean

`size()`统计不同分组的样本数量。

`prod` 沿某一轴的连乘。

In [164]:
df

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [165]:
df['Test_Number'].prod()

0

In [176]:
df['Weight'][:10].prod()

5534089981056000.0

#### 【END】
这些聚合函数当传入的数据来源包含多个列时，将按照列进行迭代计算：

In [170]:
gb = df.groupby('Gender')[['Height', 'Weight']]
gb.max()

        Height  Weight
Gender
Female   170.2    63.0
Male     193.9    89.0

In [173]:
gb.mean()

           Height     Weight
Gender
Female  159.19697  47.918519
Male    173.62549  72.759259

### 2. agg方法
虽然在`groupby`对象上定义了许多方便的函数，但仍然有以下不便之处：

* 无法同时使用多个函数
* 无法对特定的列使用特定的聚合函数
* 无法使用自定义的聚合函数
* 无法直接对结果的列名在聚合前进行自定义命名

下面说明如何通过`agg`函数解决这四类问题：

【a】使用多个函数

当使用多个聚合函数时，需要用列表的形式把内置聚合函数对应的字符串传入，先前提到的所有字符串都是合法的。

In [4]:
gb = df.groupby('Gender')[['Height', 'Weight']]

In [5]:
gb.agg(['sum', 'idxmax', 'skew'])

         Height                   Weight
            sum idxmax      skew     sum idxmax      skew
Gender
Female  21014.0     28 -0.219253  6469.0     28 -0.268482
Male     8854.9    193  0.437535  3929.0      2 -0.332393

从结果看，此时的列索引为多级索引，第一层为数据源，第二层为使用的聚合方法，分别逐一对列使用聚合，因此结果为6列。

【b】对特定的列使用特定的聚合函数

对于方法和列的特殊对应，可以通过构造字典传入`agg`中实现，其中字典以列名为键，以聚合字符串或字符串列表为值。

In [6]:
gb.agg({'Height':['mean','max'], 'Weight':'count'})

           Height        Weight
             mean    max  count
Gender
Female  159.19697  170.2    135
Male    173.62549  193.9     54

#### 【练一练】
请使用【b】中的传入字典的方法完成【a】中等价的聚合任务。

In [7]:
gb.agg({'Height': ['sum', 'idxmax', 'skew'], 'Weight': ['sum', 'idxmax', 'skew']})

         Height                   Weight
            sum idxmax      skew     sum idxmax      skew
Gender
Female  21014.0     28 -0.219253  6469.0     28 -0.268482
Male     8854.9    193  0.437535  3929.0      2 -0.332393

#### 【END】
【c】使用自定义函数

在`agg`中可以使用具体的自定义函数，$\color{#FF0000}{需要注意传入函数的参数是之前数据源中的列，逐列进行计算}$。下面分组计算身高和体重的极差：

In [8]:
gb.agg(lambda x: x.mean()-x.min())

          Height     Weight
Gender
Female  13.79697  13.918519
Male    17.92549  21.759259

#### 【练一练】
在`groupby`对象中可以使用`describe`方法进行统计信息汇总，请同时使用多个聚合函数，完成与该方法相同的功能。

In [9]:
gb.describe()

       Height                                                              \
        count       mean       std    min      25%    50%      75%    max
Gender
Female  132.0  159.19697  5.053982  145.4  155.675  159.6  162.825  170.2
Male     51.0  173.62549  7.048485  155.7  168.900  173.4  177.150  193.9

       Weight
        count       mean       std   min   25%   50%    75%   max
Gender
Female  135.0  47.918519  5.405983  34.0  44.0  48.0  52.00  63.0
Male     54.0  72.759259  7.772557  51.0  69.0  73.0  78.75  89.0

`count` 统计行/列中非缺失值元素的个数。

In [10]:
gb.agg(['count', 'mean', 'std', 'min', 'max'])

       Height                                    Weight                       \
        count       mean       std    min    max  count       mean       std
Gender
Female    132  159.19697  5.053982  145.4  170.2    135  47.918519  5.405983
Male       51  173.62549  7.048485  155.7  193.9     54  72.759259  7.772557


         min   max
Gender
Female  34.0  63.0
Male    51.0  89.0

In [12]:
gb.agg([('25%', lambda x: x.quantile(0.25))])

         Height Weight
            25%    25%
Gender
Female  155.675   44.0
Male    168.900   69.0

In [188]:
df['Height'].quantile()

161.9

In [232]:
gb.groups['Male']

Int64Index([  1,   2,   4,  10,  16,  17,  18,  21,  23,  24,  35,  36,  38,
             40,  41,  48,  50,  54,  60,  61,  66,  71,  72,  73,  74,  76,
             82,  91,  94,  95,  98,  99, 102, 116, 117, 127, 131, 134, 135,
            147, 150, 152, 153, 158, 160, 162, 165, 171, 177, 178, 179, 181,
            182, 184, 190, 192, 193, 198, 199],
           dtype='int64')

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
       156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
       169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181,
       182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194,
       195, 196, 197, 198, 199], dtype=int64)

#### 【END】
由于传入的是序列，因此序列上的方法和属性都是可以在函数中使用的，只需保证返回值是标量即可。下面的例子是指，如果组的指标均值，超过该指标的总体均值，返回High，否则返回Low。

In [15]:
def my_func(s):
    res = 'High'
    if s.mean() <= df[s.name].mean():
        res = 'Low'
    return res
gb.agg(my_func)

       Height Weight
Gender
Female    Low    Low
Male     High   High

【d】聚合结果重命名

如果想要对聚合结果的列名进行重命名，只需要将上述函数的位置改写成元组，元组的第一个元素为新的名字，第二个位置为原来的函数，包括聚合字符串和自定义函数，现举若干例子说明：

In [16]:
gb.agg([('range', lambda x: x.max()-x.min()), ('my_sum', 'sum')])

       Height          Weight
        range   my_sum  range  my_sum
Gender
Female   24.8  21014.0   29.0  6469.0
Male     38.2   8854.9   38.0  3929.0

In [17]:
gb.agg({'Height': [('my_func', my_func), 'sum'], 'Weight': lambda x:x.max()})

        Height            Weight
       my_func      sum <lambda>
Gender
Female     Low  21014.0     63.0
Male      High   8854.9     89.0

另外需要注意，对一个或者多个列使用单个聚合的时候，重命名需要加方括号，否则就不知道是新的名字还是手误输错的内置函数字符串：

In [210]:
gb.agg([('my_sum', 'sum')])

         Height  Weight
         my_sum  my_sum
Gender
Female  21014.0  6469.0
Male     8854.9  3929.0

In [18]:
gb.agg({'Height': [('my_func', my_func), 'sum'], 'Weight': [('range', lambda x:x.max())]})

        Height          Weight
       my_func      sum  range
Gender
Female     Low  21014.0   63.0
Male      High   8854.9   89.0

## 三、变换和过滤
### 1. 变换函数与transform方法
变换函数的返回值为同长度的序列，最常用的内置变换函数是累计函数：`cumcount/cumsum/cumprod/cummax/cummin`，它们的使用方式和聚合函数类似，只不过完成的是组内累计操作。此外在`groupby`对象上还定义了填充类和滑窗类的变换函数，这些函数的一般形式将会分别在第七章和第十章中讨论，此处略过。

In [21]:
gb.groups

{'Female': [0, 3, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 19, 20, 22, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 37, 39, 42, 43, 44, 45, 46, 47, 49, 51, 52, 53, 55, 56, 57, 58, 59, 62, 63, 64, 65, 67, 68, 69, 70, 75, 77, 78, 79, 80, 81, 83, 84, 85, 86, 87, 88, 89, 90, 92, 93, 96, 97, 100, 101, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 118, 119, 120, 121, 122, 123, 124, 125, 126, 128, 129, 130, 132, 133, 136, 137, 138, ...], 'Male': [1, 2, 4, 10, 16, 17, 18, 21, 23, 24, 35, 36, 38, 40, 41, 48, 50, 54, 60, 61, 66, 71, 72, 73, 74, 76, 82, 91, 94, 95, 98, 99, 102, 116, 117, 127, 131, 134, 135, 147, 150, 152, 153, 158, 160, 162, 165, 171, 177, 178, 179, 181, 182, 184, 190, 192, 193, 198, 199]}

In [33]:
df[['Height', 'Weight', 'Gender']].head(10)

   Height  Weight  Gender
0   158.9    46.0  Female
1   166.5    70.0    Male
2   188.9    89.0    Male
3     NaN    41.0  Female
4   174.0    74.0    Male
5   158.0    51.0  Female
6   162.5    52.0  Female
7   161.9    50.0  Female
8   163.0    48.0  Female
9   164.8     NaN  Female

In [32]:
gb.cummax().head(10)

   Height  Weight
0   158.9    46.0
1   166.5    70.0
2   188.9    89.0
3     NaN    46.0
4   188.9    89.0
5   158.9    51.0
6   162.5    52.0
7   162.5    52.0
8   163.0    52.0
9   164.8     NaN

In [36]:
gb.cummin().head(10)

   Height  Weight
0   158.9    46.0
1   166.5    70.0
2   166.5    70.0
3     NaN    41.0
4   166.5    70.0
5   158.0    41.0
6   158.0    41.0
7   158.0    41.0
8   158.0    41.0
9   158.0     NaN

In [34]:
gb.cumcount().head(10)

0    0
1    0
2    1
3    1
4    2
5    2
6    3
7    4
8    5
9    6
dtype: int64

In [35]:
gb.cumsum().head(10)

   Height  Weight
0   158.9    46.0
1   166.5    70.0
2   355.4   159.0
3     NaN    87.0
4   529.4   233.0
5   316.9   138.0
6   479.4   190.0
7   641.3   240.0
8   804.3   288.0
9   969.1     NaN

In [23]:
gb.cumprod().head(10)

         Height        Weight
0  1.589000e+02  4.600000e+01
1  1.665000e+02  7.000000e+01
2  3.145185e+04  6.230000e+03
3           NaN  1.886000e+03
4  5.472622e+06  4.610200e+05
5  2.510620e+04  9.618600e+04
6  4.079758e+06  5.001672e+06
7  6.605127e+08  2.500836e+08
8  1.076636e+11  1.200401e+10
9  1.774296e+13           NaN

`groupby.umcount()` 函数的用法，原文档的例子。

https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.GroupBy.cumcount.html

翻译成中文，就是，按组给各行进行编号。得到的结果是，这一行在对应的组里是第几个元素，从 0 开始编号。

In [39]:
df_ex = pd.DataFrame([['a'], ['a'], ['a'], ['b'], ['b'], ['a']], columns=['A'])
df_ex

   A
0  a
1  a
2  a
3  b
4  b
5  a

In [41]:
df_ex.groupby("A").cumcount()

0    0
1    1
2    2
3    0
4    1
5    3
dtype: int64

#### 【练一练】
在`groupby`对象中，`rank`方法也是一个实用的变换函数，请查阅它的功能并给出一个使用的例子。

In [215]:
df['Height']

0      158.9
1      166.5
2      188.9
3        NaN
4      174.0
       ...
195    153.9
196    160.9
197    153.9
198    175.3
199    155.7
Name: Height, Length: 200, dtype: float64

In [214]:
df['Height'].rank()

0       59.0
1      127.0
2      182.0
3        NaN
4      159.0
       ...
195     21.5
196     84.0
197     21.5
198    163.0
199     34.5
Name: Height, Length: 200, dtype: float64

#### 【END】
当用自定义变换时需要使用`transform`方法，被调用的自定义函数，$\color{#FF0000}{其传入值为数据源的序列}$，与`agg`的传入类型是一致的，其最后的返回结果是行列索引与数据源一致的`DataFrame`。

现对身高和体重进行分组标准化，即减去组均值后除以组的标准差：

In [237]:
gb.transform(lambda x: (x-x.mean())/x.std()).head()

     Height    Weight
0 -0.058760 -0.354888
1 -1.010925 -0.355000
2  2.167063  2.089498
3       NaN -1.279789
4  0.053133  0.159631

#### 【练一练】
对于`transform`方法无法像`agg`一样，通过传入字典来对指定列使用特定的变换，如果需要在一次`transform`的调用中实现这种功能，请给出解决方案。

把每一列单独提取出来成为一个 series，然后进行变换之后再写回去。

#### 【END】
前面提到了`transform`只能返回同长度的序列，但事实上还可以返回一个标量，这会使得结果被广播到其所在的整个组，这种$\color{#FF0000}{标量广播}$的技巧在特征工程中是非常常见的。例如，构造两列新特征来分别表示样本所在性别组的身高均值和体重均值：

In [240]:
gb.transform('mean').head() # 传入返回标量的函数也是可以的

      Height     Weight
0  159.19697  47.918519
1  173.62549  72.759259
2  173.62549  72.759259
3  159.19697  47.918519
4  173.62549  72.759259

### 2. 组索引与过滤

在上一章中介绍了索引的用法，那么索引和过滤有什么区别呢？

过滤在分组中是对于组的过滤，而索引是对于行的过滤，在第二章中的返回值，无论是布尔列表还是元素列表或者位置列表，本质上都是对于行的筛选，即如果符合筛选条件的则选入结果表，否则不选入。

组过滤作为行过滤的推广，指的是如果对一个组的全体所在行进行统计的结果返回`True`则会被保留，`False`则该组会被过滤，最后把所有未被过滤的组其对应的所在行拼接起来作为`DataFrame`返回。

在`groupby`对象中，定义了`filter`方法进行组的筛选，其中自定义函数的输入参数为数据源构成的`DataFrame`本身，在之前例子中定义的`groupby`对象中，传入的就是`df[['Height', 'Weight']]`，因此所有表方法和属性都可以在自定义函数中相应地使用，同时只需保证自定义函数的返回为布尔值即可。

文档中的例子

https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.filter.html

In [73]:
df_tmp = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar'],
                   'B' : [1, 2, 3, 4, 5, 6],
                   'C' : [2.0, 5., 8., 1., 2., 9.]})
df_tmp

     A  B    C
0  foo  1  2.0
1  bar  2  5.0
2  foo  3  8.0
3  bar  4  1.0
4  foo  5  2.0
5  bar  6  9.0

In [75]:
grouped = df_tmp.groupby("A")

In [84]:
grouped.value_counts()

A    B  C
bar  2  5.0    1
     4  1.0    1
     6  9.0    1
foo  1  2.0    1
     3  8.0    1
     5  2.0    1
dtype: int64

In [77]:
grouped.filter(lambda x: x['B'].mean() > 3)

     A  B    C
1  bar  2  5.0
3  bar  4  1.0
5  bar  6  9.0

例如，在原表中通过过滤得到所有容量大于100的组：

In [44]:
gb.filter(lambda x: x.shape[0] > 100).head()

   Height  Weight
0   158.9    46.0
3     NaN    41.0
5   158.0    51.0
6   162.5    52.0
7   161.9    50.0

In [51]:
gb.groups.keys()

dict_keys(['Female', 'Male'])

In [53]:
gb.groups['Female'].shape

(141,)

In [54]:
gb.groups['Male'].shape

(59,)

In [63]:
gb.filter(lambda x: x.shape[0] > 100)

     Height  Weight
0     158.9    46.0
3       NaN    41.0
5     158.0    51.0
6     162.5    52.0
7     161.9    50.0
..      ...     ...
191   166.6    54.0
194   160.3    49.0
195   153.9    46.0
196   160.9    50.0
197   153.9    45.0

[141 rows x 2 columns]

In [80]:
gb.value_counts()

Gender  Test_Number  Height  Weight
Female  1            159.3   49.0      2
                     160.3   49.0      2
                     145.4   34.0      1
                     150.5   36.0      1
                     161.2   47.0      1
                                      ..
Male    3            162.4   58.0      1
                     170.5   73.0      1
                     171.4   70.0      1
                     175.5   73.0      1
                     185.3   87.0      1
Length: 172, dtype: int64

In [81]:
gb = df.groupby('Gender')[['Height', 'Weight']]

In [82]:
gb.value_counts()

Gender  Height  Weight
Female  158.0   51.0      2
        160.3   49.0      2
        159.3   49.0      2
        166.8   55.0      1
        165.3   57.0      1
                         ..
Male    171.4   70.0      1
        172.2   75.0      1
        173.4   72.0      1
                77.0      1
        193.9   79.0      1
Length: 170, dtype: int64

In [90]:
gb.agg('mean')

           Height     Weight
Gender
Female  159.19697  47.918519
Male    173.62549  72.759259

In [92]:
gb.filter(lambda x: x['Height'].mean() > 159)
# 不懂

     Height  Weight
0     158.9    46.0
1     166.5    70.0
2     188.9    89.0
3       NaN    41.0
4     174.0    74.0
..      ...     ...
195   153.9    46.0
196   160.9    50.0
197   153.9    45.0
198   175.3    71.0
199   155.7    51.0

[200 rows x 2 columns]

所以上面的操作，其实是过滤掉了 `Male` 的组。

#### 【练一练】
从概念上说，索引功能是组过滤功能的子集，请使用`filter`函数完成`loc[...]`的功能，这里假设"`...`"是元素列表。

`loc[...]` 选择行。

In [55]:
df

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [57]:
df.loc[lambda x: x.index>100]

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
101,Peking University,Sophomore,Xiaoli Zhou,Female,166.8,55.0,N,1,2019/10/28,0:05:24
102,Peking University,Junior,Chengli Zhao,Male,NaN,NaN,NaN,1,2019/10/13,0:03:55
103,Shanghai Jiao Tong University,Senior,Mei Chen,Female,153.6,NaN,N,2,2019/11/3,0:04:57
104,Shanghai Jiao Tong University,Senior,Xiaopeng Lv,Female,158.4,47.0,N,2,2019/10/3,0:05:07
105,Fudan University,Freshman,Qiang Shi,Female,164.5,52.0,N,1,2019/12/11,0:04:23
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [98]:
gb.filter(lambda x: x['Weight'].mean() == 46 )

Empty DataFrame
Columns: [Height, Weight]
Index: []

#### 【END】
## 四、跨列分组
### 1. apply的引入
之前几节介绍了三大分组操作，但事实上还有一种常见的分组场景，无法用前面介绍的任何一种方法处理，例如现在如下定义身体质量指数BMI：
$${\rm BMI} = {\rm\frac{Weight}{Height^2}}$$
其中体重和身高的单位分别为千克和米，需要分组计算组BMI的均值。

首先，这显然不是过滤操作，因此`filter`不符合要求；其次，返回的均值是标量而不是序列，因此`transform`不符合要求；最后，似乎使用`agg`函数能够处理，但是之前强调过聚合函数是逐列处理的，而不能够$\color{#FF0000}{多列数据同时处理}$。由此，引出了`apply`函数来解决这一问题。

### 2. apply的使用
在设计上，`apply`的自定义函数传入参数与`filter`完全一致，只不过后者只允许返回布尔值。现如下解决上述计算问题：

In [66]:
def BMI(x):
    Height = x['Height']/100
    Weight = x['Weight']
    BMI_value = Weight/Height**2
    return BMI_value.mean()
gb.apply(BMI)

Gender
Female    18.860930
Male      24.318654
dtype: float64

除了返回标量之外，`apply`方法还可以返回一维`Series`和二维`DataFrame`，但它们产生的数据框维数和多级索引的层数应当如何变化？下面举三组例子就非常容易明白结果是如何生成的：

【a】标量情况：结果得到的是 ``Series`` ，索引与 ``agg`` 的结果一致

In [67]:
gb = df.groupby(['Gender','Test_Number'])[['Height','Weight']]
gb.apply(lambda x: 0)

Gender  Test_Number
Female  1              0
        2              0
        3              0
Male    1              0
        2              0
        3              0
dtype: int64

In [68]:
gb.agg(lambda x: 0)

                    Height  Weight
Gender Test_Number
Female 1                 0       0
       2                 0       0
       3                 0       0
Male   1                 0       0
       2                 0       0
       3                 0       0

In [69]:
gb.apply(lambda x: [0, 0]) # 虽然是列表，但是作为返回值仍然看作标量

Gender  Test_Number
Female  1              [0, 0]
        2              [0, 0]
        3              [0, 0]
Male    1              [0, 0]
        2              [0, 0]
        3              [0, 0]
dtype: object

In [70]:
gb.agg(lambda x: [0, 0])

                    Height  Weight
Gender Test_Number
Female 1            [0, 0]  [0, 0]
       2            [0, 0]  [0, 0]
       3            [0, 0]  [0, 0]
Male   1            [0, 0]  [0, 0]
       2            [0, 0]  [0, 0]
       3            [0, 0]  [0, 0]

【b】`Series`情况：得到的是`DataFrame`，行索引与标量情况一致，列索引为`Series`的索引

In [71]:
gb.apply(lambda x: pd.Series([0,0],index=['a','b']))

                    a  b
Gender Test_Number
Female 1            0  0
       2            0  0
       3            0  0
Male   1            0  0
       2            0  0
       3            0  0

#### 【练一练】
请尝试在`apply`传入的自定义函数中，根据组的某些特征返回相同长度但索引不同的`Series`，会报错吗？
#### 【END】
【c】`DataFrame`情况：得到的是`DataFrame`，行索引最内层在每个组原先`agg`的结果索引上，再加一层返回的`DataFrame`行索引，同时分组结果`DataFrame`的列索引和返回的`DataFrame`列索引一致。

In [34]:
gb.apply(lambda x: pd.DataFrame(np.ones((2,2)), index = ['a','b'], columns=pd.Index([('w','x'),('y','z')])))

                        w    y
                        x    z
Gender Test_Number
Female 1           a  1.0  1.0
                   b  1.0  1.0
       2           a  1.0  1.0
                   b  1.0  1.0
       3           a  1.0  1.0
                   b  1.0  1.0
Male   1           a  1.0  1.0
                   b  1.0  1.0
       2           a  1.0  1.0
                   b  1.0  1.0
       3           a  1.0  1.0
                   b  1.0  1.0

#### 【练一练】
请尝试在`apply`传入的自定义函数中，根据组的某些特征返回相同大小但列索引不同的`DataFrame`，会报错吗？如果只是行索引不同，会报错吗？

#### 【END】
最后需要强调的是，`apply`函数的灵活性是以牺牲一定性能为代价换得的，除非需要使用跨列处理的分组处理，否则应当使用其他专门设计的`groupby`对象方法，否则在性能上会存在较大的差距。同时，在使用聚合函数和变换函数时，也应当优先使用内置函数，它们经过了高度的性能优化，一般而言在速度上都会快于用自定义函数来实现。

#### 【练一练】
在`groupby`对象中还定义了`cov`和`corr`函数，从概念上说也属于跨列的分组处理。请利用之前定义的`gb`对象，使用apply函数实现与`gb.cov()`同样的功能并比较它们的性能。

In [99]:
gb.cov()

                  Height     Weight
Gender
Female Height  25.542739  24.838146
       Weight  24.838146  29.224655
Male   Height  49.681137  47.803901
       Weight  47.803901  60.412648

In [108]:
def cov_x(x):
    
    return np.cov(x, ddof=1)
gb.apply(cov_x)

TypeError: Series.name must be a hashable type

关于 `cov` 的用法，文档所附

https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.cov.html

In [101]:
df_tmp = pd.DataFrame([(1, 2), (0, 3), (2, 0), (1, 1)],
                  columns=['dogs', 'cats'])
df_tmp

   dogs  cats
0     1     2
1     0     3
2     2     0
3     1     1

In [106]:
df_tmp.cov()

          dogs      cats
dogs  0.666667 -1.000000
cats -1.000000  1.666667

In [103]:
np.random.seed(42)
df_tmp2 = pd.DataFrame(np.random.randn(1000, 5),
                  columns=['a', 'b', 'c', 'd', 'e'])
df_tmp2

            a         b         c         d         e
0    0.496714 -0.138264  0.647689  1.523030 -0.234153
1   -0.234137  1.579213  0.767435 -0.469474  0.542560
2   -0.463418 -0.465730  0.241962 -1.913280 -1.724918
3   -0.562288 -1.012831  0.314247 -0.908024 -1.412304
4    1.465649 -0.225776  0.067528 -1.424748 -0.544383
..        ...       ...       ...       ...       ...
995 -1.373835  1.378470  0.115825  0.389605 -2.220421
996 -1.197966  0.887080  0.286774 -0.147205  0.564842
997  1.635798 -0.221042  0.069370  0.192597  2.392110
998 -2.099356  0.683223 -0.114802  0.566772 -0.657373
999 -0.048965  0.711411  3.112910  0.808036 -0.848066

[1000 rows x 5 columns]

In [105]:
df_tmp2.cov()

          a         b         c         d         e
a  0.998438 -0.020161  0.059277 -0.008943  0.014144
b -0.020161  1.059352 -0.008543 -0.024738  0.009826
c  0.059277 -0.008543  1.010670 -0.001486 -0.000271
d -0.008943 -0.024738 -0.001486  0.921297 -0.013692
e  0.014144  0.009826 -0.000271 -0.013692  0.977795

#### 【END】
## 五、练习
### Ex1：汽车数据集
现有一份汽车数据集，其中`Brand, Disp., HP`分别代表汽车品牌、发动机蓄量、发动机输出。

In [109]:
df = pd.read_csv('../data/car.csv')
df.head(3)

,Brand,Price,Country,Reliability,Mileage,Type,Weight,Disp.,HP
0,Eagle Summit 4,8895,USA,4.0,33,Small,2560,97,113
1,Ford Escort 4,7402,USA,2.0,33,Small,2345,114,90
2,Ford Festiva 4,6319,Korea,4.0,37,Small,1845,81,63

In [113]:
df.shape

(60, 9)

In [132]:
#df

1. 先过滤出所属`Country`数超过2个的汽车，即若该汽车的`Country`在总体数据集中出现次数不超过2则剔除，再按`Country`分组计算价格均值、价格变异系数、该`Country`的汽车数量，其中变异系数的计算方法是标准差除以均值，并在结果中把变异系数重命名为`CoV`。
2. 按照表中位置的前三分之一、中间三分之一和后三分之一分组，统计`Price`的均值。
3. 对类型`Type`分组，对`Price`和`HP`分别计算最大值和最小值，结果会产生多级索引，请用下划线把多级列索引合并为单层索引。
4. 对类型`Type`分组，对`HP`进行组内的`min-max`归一化。
5. 对类型`Type`分组，计算`Disp.`与`HP`的相关系数。

In [123]:
df_1 = df.copy()

In [124]:
df_1 = df_1.groupby('Country')

In [127]:
#df.groupby('Country').filter(lambda x: x.shape[0]>2).shape
df_1 = df_1.filter(lambda x: x.shape[0]>2)

In [129]:
df_1.shape

(55, 9)

In [140]:
df_1 = df_1.groupby('Country')

In [147]:
df_1.agg({'Price': ['mean', ('CoV', lambda x: x.std() / x.mean())], 'Country': [('num', lambda x: x.shape[0])]})

                  Price           Country
                   mean       CoV     num
Country
Japan      13938.052632  0.387429      19
Japan/USA  10067.571429  0.240040       7
Korea       7857.333333  0.243435       3
USA        12543.269231  0.203344      26

2. 按照表中位置的前三分之一、中间三分之一和后三分之一分组，统计`Price`的均值。

In [149]:
df_2 = df.copy()
df_2.shape

(60, 9)

In [154]:
cond = ['Head'] * 20 + ['Mid'] * 20 + ['Tail'] * 20
df_2.groupby(cond)['Price'].mean()

Head     9069.95
Mid     13356.40
Tail    15420.65
Name: Price, dtype: float64

3. 对类型`Type`分组，对`Price`和`HP`分别计算最大值和最小值，结果会产生多级索引，请用下划线把多级列索引合并为单层索引。

In [156]:
df_3 = df.copy()

In [157]:
df_3.head()

,Brand,Price,Country,Reliability,Mileage,Type,Weight,Disp.,HP
0,Eagle Summit 4,8895,USA,4.0,33,Small,2560,97,113
1,Ford Escort 4,7402,USA,2.0,33,Small,2345,114,90
2,Ford Festiva 4,6319,Korea,4.0,37,Small,1845,81,63
3,Honda Civic 4,6635,Japan/USA,5.0,32,Small,2260,91,92
4,Mazda Protege 4,6599,Japan,5.0,32,Small,2440,113,103

In [158]:
df_3 = df_3.groupby('Type').agg({'Price': ['min', 'max'], 'HP': ['min', 'max']})

In [163]:
df_3

         Price          HP
           min    max  min  max
Type
Compact   9483  18900   95  142
Large    14525  17257  150  170
Medium    9999  24760  110  190
Small     5866   9995   63  113
Sporty    9410  13945   92  225
Van      12267  15395  106  150

In [167]:
df_3_tmp = df_3.copy()
new_clos = df_3_tmp.columns.map(lambda x: (x[0] + '_' + x[1]))
df_3_tmp.columns = new_clos
df_3_tmp

         Price_min  Price_max  HP_min  HP_max
Type
Compact       9483      18900      95     142
Large        14525      17257     150     170
Medium        9999      24760     110     190
Small         5866       9995      63     113
Sporty        9410      13945      92     225
Van          12267      15395     106     150

4. 对类型`Type`分组，对`HP`进行组内的`min-max`归一化。

In [175]:
df_3 = df.copy()
df_3 = df_3.groupby('Type')
df_3.apply(lambda x: (x['HP'] - x['HP'].min()) / (x['HP'].max() - x['HP'].min()))

Type
Compact  22    0.276596
         23    0.319149
         24    0.000000
         25    0.978723
         26    0.063830
         27    0.638298
         28    0.319149
         29    0.148936
         30    1.000000
         31    0.914894
         32    0.319149
         33    0.531915
         34    0.744681
         35    0.425532
         36    0.404255
Large    50    0.750000
         51    1.000000
         52    0.000000
Medium   37    0.625000
         38    0.000000
         39    0.500000
         40    0.462500
         41    0.500000
         42    0.375000
         43    0.375000
         44    0.000000
         45    0.600000
         46    0.625000
         47    0.000000
         48    0.312500
         49    1.000000
Small    0     1.000000
         1     0.540000
         2     0.000000
         3     0.580000
         4     0.800000
         5     0.380000
         6     0.540000
         7     0.220000
         8     0.540000
         9     0.200000
         10    0.780000
         11    0.300000
         12    0.740000
Sporty   13    0.586466
         14    0.060150
         15    1.000000
         16    0.135338
         17    0.120301
         18    0.360902
         19    0.360902
         20    0.000000
         21    0.037594
Van      53    0.090909
         54    1.000000
         55    0.886364
         56    1.000000
         57    0.022727
         58    0.727273
         59    0.000000
Name: HP, dtype: float64

In [185]:
def normalize(s):
    s_min, s_max = s.min(), s.max()
    return (s - s_min) / (s_max - s_min)

df_3['HP'].transform(normalize)

0     1.000000
1     0.540000
2     0.000000
3     0.580000
4     0.800000
5     0.380000
6     0.540000
7     0.220000
8     0.540000
9     0.200000
10    0.780000
11    0.300000
12    0.740000
13    0.586466
14    0.060150
15    1.000000
16    0.135338
17    0.120301
18    0.360902
19    0.360902
20    0.000000
21    0.037594
22    0.276596
23    0.319149
24    0.000000
25    0.978723
26    0.063830
27    0.638298
28    0.319149
29    0.148936
30    1.000000
31    0.914894
32    0.319149
33    0.531915
34    0.744681
35    0.425532
36    0.404255
37    0.625000
38    0.000000
39    0.500000
40    0.462500
41    0.500000
42    0.375000
43    0.375000
44    0.000000
45    0.600000
46    0.625000
47    0.000000
48    0.312500
49    1.000000
50    0.750000
51    1.000000
52    0.000000
53    0.090909
54    1.000000
55    0.886364
56    1.000000
57    0.022727
58    0.727273
59    0.000000
Name: HP, dtype: float64

In [187]:
df_3['HP'].count()

Type
Compact    15
Large       3
Medium     13
Small      13
Sporty      9
Van         7
Name: HP, dtype: int64

5. 对类型`Type`分组，计算`Disp.`与`HP`的相关系数。

In [191]:
def corr(x):
    return np.corrcoef(x['HP'], x['Disp.'])

In [195]:
np.array(df_3.apply(corr))

array([array([[1.        , 0.58608741],
              [0.58608741, 1.        ]]),
       array([[ 1.       , -0.2427646],
              [-0.2427646,  1.       ]]),
       array([[1.        , 0.37049098],
              [0.37049098, 1.        ]]),
       array([[1.        , 0.60391596],
              [0.60391596, 1.        ]]),
       array([[1.        , 0.87142554],
              [0.87142554, 1.        ]]),
       array([[1.        , 0.81988141],
              [0.81988141, 1.        ]])], dtype=object)

In [198]:
df_3[['HP', 'Disp.']].apply(lambda x: np.corrcoef(x['HP'].values, x['Disp.'].values)[0, 1])

Type
Compact    0.586087
Large     -0.242765
Medium     0.370491
Small      0.603916
Sporty     0.871426
Van        0.819881
dtype: float64

In [201]:
df_3[['HP', 'Disp.']].apply(lambda x: np.corrcoef(x['HP'].values, x['Disp.'].values)[0, 1])

Type
Compact    0.586087
Large     -0.242765
Medium     0.370491
Small      0.603916
Sporty     0.871426
Van        0.819881
dtype: float64

### Ex2：实现transform函数
* `groupby`对象的构造方法是`my_groupby(df, group_cols)`
* 支持单列分组与多列分组
* 支持带有标量广播的`my_groupby(df)[col].transform(my_func)`功能
* `pandas`的`transform`不能跨列计算，请支持此功能，即仍返回`Series`但`col`参数为多列
* 无需考虑性能与异常处理，只需实现上述功能，在给出测试样例的同时与`pandas`中的`transform`对比结果是否一致